       IDENTIFICATION DIVISION.
       PROGRAM-ID. P01.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMBER-ONE PIC 9(2) VALUE 0.
       01 NUMBER-TWO PIC 9(2) VALUE 0.
       01 NUMBER-SUM PIC 9(3) VALUE 0.

       PROCEDURE DIVISION.
           DISPLAY "NUMBER-ONE: ".
           ACCEPT NUMBER-ONE.
           DISPLAY "NUMBER-TWO: ".
           ACCEPT NUMBER-TWO.
           
           ADD NUMBER-ONE TO NUMBER-TWO GIVING NUMBER-SUM.
           DISPLAY "SUM: " NUMBER-SUM.

           STOP RUN.